<template>
  <div class="use-infomation">
    <h2 class="title">汉典云健康平台用户服务协议</h2>
    <p class="content-1">欢迎您使用汉典云健康平台！</p>
    <p class="content-2">
      为使用汉典云健康平台，您应当阅读并遵守《
      汉典云健康平台服务协议》（以下简称“本协议”）。请您务必审慎阅读、充分理解各条款内容，特别是免除或限制责任的相应条款、法律适用和管辖条款，以及开通或使用某项服务的单独协议，并选择接受或不接受。限制、免除责任条款及法律适用和管辖条款可能以加粗、下划线形式提示您注意。
    </p>
    <p class="content-3">
      除非您已阅读并接受本协议所有条款，否则您无权使用汉典云健康平台服务（以下简称“本服务”）。您对本服务的登录、查看等使用行为即视为您已阅读并同意本协议的约束。如果您未满18周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款。
    </p>
    <van-skeleton title :row="30" :loading="loading">
      <div class="content-4" v-for="(one, index) in fileData" :key="index">
        <div class="one-title">{{ one.title }}</div>
        <div v-for="(two, index) in one.content" :key="index">
          <div class="two-title">{{ two.title }}</div>
          <div v-for="(three, index) in two.content" :key="index">
            <div class="three-title">{{ three.title }}</div>
            <div v-for="(four, index) in three.content" :key="index">
              <div class="four-title">{{ four.title }}</div>
              <div v-for="(five, index) in four.content" :key="index">
                <div class="five-title">{{ five.title }}</div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </van-skeleton>
  </div>
</template>

<script>
export default {
  name: "UseInfomation",
  data() {
    return {
      loading: true,
      fileData: [
        {
          title: "1. 协议的范围",
          content: [
            {
              title: "1.1 协议适用主体范围",
              content: [
                {
                  title:
                    "本协议是您与汉典之间关于您使用汉典云健康平台（以下简称“本服务”）所订立的协议。“用户”是指本服务的使用人，在本协议中更多地称为“您”。"
                }
              ]
            },
            {
              title: "1.2 协议关系及冲突条款",
              content: [
                {
                  title:
                    "本协议内容同时包括汉典可能不断发布的关于本服务的相关协议、业务规则等内容。上述内容一经正式发布，即为本协议不可分割的组成部分，您同样应当遵守。"
                }
              ]
            }
          ]
        },
        {
          title: "2. 关于本服务",
          content: [
            {
              title: "2.1 本服务的内容",
              content: [
                {
                  title:
                    "本服务可利用云健康小程序为您提供中医名医专家快速查找、线上复诊及拍方抓药等服务，具体以您实际使用为准。本服务旨在为您提供预约咨询、线上复诊、复诊开药等一站式复诊就医服务流程。"
                }
              ]
            },
            {
              title: "2.2 本服务的形式",
              content: [
                {
                  title:
                    "2.2.1 您需要通过汉典云健康小程序使用本服务，您仅可为访问或使用本服务的目的而使用小程序及相关服务。"
                }
              ]
            },
            {
              title: "2.3 本服务许可的范围",
              content: [
                {
                  title:
                    "2.3.1 汉典给予您个人专属的、不可转让的许可，以使用本服务。"
                },
                {
                  title:
                    "2.3.2 本条及本协议其他条款未明示授权的其他一切权利仍由汉典保留，您在行使这些权利时须另外取得汉典的许可。汉典如果未行使前述任何权利，并不构成对该权利的放弃。"
                }
              ]
            }
          ]
        },
        {
          title: "3. 服务的获取",
          content: [
            {
              title: "3.1.基于汉典云健康小程序, 遵循本协议相关规定。",
              content: []
            },
            {
              title:
                "3.2 如果您从未经汉典授权的渠道获取本服务，汉典无法保证服务的稳定性及内容可靠程度，并对因此给您造成的损失不予负责。",
              content: []
            }
          ]
        },
        {
          title: "4. 服务的使用",
          content: [
            {
              title:
                "4.1 汉典可能为不同的终端设备开发了不同的版本（包括但不限于软件），您应当根据实际情况选择合适的版本使用。"
            },
            {
              title:
                "4.2 您在使用本服务前，应确保患者（包括但不仅限于您本人）均属于复诊，而非首次诊断治疗服务。如果属于首次诊断，将不可使用本服务，建议您到线下医疗机构进行门诊治疗。"
            },
            {
              title:
                "4.3您承诺所提交的患者信息均为属实。如您违反上述承诺，汉典可拒绝向您提供本服务，给汉典造成任何损失的，汉典有权依法追究您的责任。"
            },
            {
              title:
                "4.4为确保合理正当使用本服务，您同意本服务采用技术或人工方式（具体由本服务根据实际情况确定）对您提交的信息内容进行核验。对于无法通过核验的内容，本服务可拒绝提供复诊、开方抓药等一切相关服务。"
            }
          ]
        },
        {
          title: "5. 服务的更新",
          content: [
            {
              title:
                "5.1 为了改善用户体验、完善服务内容，汉典将不断努力开发新的服务，并不时提供更新（这些更新可能会采取服务替换、修改、功能强化、版本升级等形式）。"
            },
            {
              title:
                "5.2 为了保证本服务的安全性和功能的一致性，汉典有权不经向您特别通知而对本服务进行更新，或者对本服务的部分功能效果进行改变或限制。"
            }
          ]
        },
        {
          title: "6. 用户个人信息保护",
          content: [
            {
              title:
                "6.1 保护用户个人信息是汉典的一项基本原则。汉典将按照本协议的规定收集、使用、储存和分享您的个人信息。"
            },
            {
              title:
                "6.2 汉典将会采取合理的措施保护用户的个人信息。汉典对相关信息采用专业加密存储与传输方式，保障用户个人信息的安全。"
            },
            {
              title:
                "6.3 您在使用本服务或使用本服务中接入的某一特定服务的过程中，可能需要提供一些必要的信息。若国家法律法规或政策有特殊规定的，您需要提供真实的身份信息，您必须保证您所提供的所有信息真实、准确、完整、有效。若您提供的信息不完整、不准确的，则可能无法使用本服务相关功能或在使用过程中受到限制。"
            },
            {
              title:
                "6.4 一般情况下，您可随时浏览、修改自己提交的信息，但出于安全性和身份识别的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。"
            },
            {
              title:
                "6.5 汉典将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。"
            },
            {
              title:
                "6.6 未经您的同意，汉典不会向汉典以外的任何公司、组织和个人披露您的个人信息，但法律法规另有规定的除外。"
            },
            {
              title:
                "6.7 汉典非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用汉典的服务前，应事先取得您家长或法定监护人的书面同意。或者您可邀请您的家长或法定监护人来使用本服务。"
            }
          ]
        },
        {
          title: "7. 主权利义务条款",
          content: [
            {
              title: "7.1 用户注意事项",
              content: [
                {
                  title:
                    "7.1.1 您理解并同意：为了向您提供有效的服务，本服务会利用您终端设备和网络等资源。本服务使用过程中可能产生数据流量的费用，用户需自行向运营商了解相关资费信息，并自行承担相关费用。"
                },
                {
                  title:
                    "7.1.2 您在使用本服务中接入的某一特定服务时，该特定服务可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”），您在使用该项服务前请阅读并同意相关的单独协议。"
                },
                {
                  title:
                    "7.1.3 您保证本服务中存储的数据信息均系通过合法渠道获得并有权在本服务中进行存储，上述数据信息的收集、使用等过程不违反任何法律法规且不侵犯任何第三方权利以及对您有约束力的任何法律文件。"
                },
                {
                  title:
                    "7.1.4 您理解并同意汉典将会尽其商业上的合理努力保障您在本服务中的数据存储安全，但是，汉典并不能就此提供完全保证，包括但不限于以下情形：",
                  content: [
                    {
                      title:
                        "7.1.4.1 汉典不对您在本服务中相关数据的删除或储存失败负责。"
                    },
                    {
                      title:
                        "7.1.4.2 汉典有权根据实际情况自行决定单个用户在本服务中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。您可根据自己的需要自行备份本服务中的相关数据。"
                    },
                    {
                      title:
                        "7.1.4.3 如果您停止使用本服务或服务被终止或取消，汉典可以从服务器上永久地删除您的数据。服务停止、终止或取消后，汉典没有义务向您返还任何数据。"
                    }
                  ]
                },
                {
                  title:
                    "7.1.5 用户在使用本服务时，须自行承担如下来自汉典不可掌控的风险内容，包括但不限于",
                  content: [
                    {
                      title:
                        "7.1.5.1 由于不可抗拒因素可能引起的个人信息丢失、泄漏等风险。"
                    },
                    {
                      title:
                        "7.1.5.2 用户必须选择与所使用终端设备相匹配的服务版本，否则，由于服务与终端设备型号不相匹配所导致的任何问题或损害，均由用户自行承担。"
                    },
                    {
                      title:
                        "7.1.5.3 用户在使用本服务访问第三方网站时，因第三方网站及相关内容所可能导致的风险，由用户自行承担。"
                    },
                    {
                      title:
                        "7.1.5.4 由于无线网络信号不稳定、无线网络带宽小等原因，所引起的登录失败、资料同步不完整、页面打开速度慢等风险。"
                    }
                  ]
                },
                {
                  title:
                    "7.1.2 您在使用本服务中接入的某一特定服务时，该特定服务可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”），您在使用该项服务前请阅读并同意相关的单独协议。"
                },
                {
                  title:
                    "7.1.2 您在使用本服务中接入的某一特定服务时，该特定服务可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”），您在使用该项服务前请阅读并同意相关的单独协议。"
                }
              ]
            },
            {
              title: "7.2 第三方产品和服务",
              content: [
                {
                  title:
                    "7.2.1 您在使用本服务中由第三方提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的服务协议、声明、提示等法律文件和重要信息。您在使用此类第三方产品或服务前，应仔细阅读上述信息，如您不同意前述内容，您可停止使用相关产品或服务。汉典和第三方对可能出现的纠纷在法律规定和约定的范围内各自承担责任。"
                },
                {
                  title:
                    "7.2.2 本服务可能会调用第三方系统或者通过第三方支持用户的使用或访问，相关服务结果及内容由该第三方提供，汉典不保证第三方提供服务及内容的安全性、准确性、有效性及不存在其他不确定的风险，由此若引发的任何争议及损害，与汉典无关，汉典不承担任何责任。"
                },
                {
                  title:
                    "7.2.3 您理解并同意，汉典有权决定将本服务作商业用途，包括但不限于开发、使用本服务的部分功能为第三方进行推广等。"
                }
              ]
            }
          ]
        },
        {
          title: "8. 用户行为规范",
          content: [
            {
              title: "8.1 信息内容规范",
              content: [
                {
                  title:
                    "8.1.1 本条所述信息内容是指用户使用本服务过程中所提交的任何内容，包括但不限于文字、语音、图片等发送、回复和相关链接页面，以及其他使用本服务所产生的内容。"
                },
                {
                  title:
                    "8.1.2 您理解并同意，汉典一直致力于为用户提供文明健康、规范有序的网络环境，您不得利用本服务上传、编辑、发布、传播如下干扰本服务正常运营，以及侵犯其他用户或第三方合法权益的内容，包括但不限于:",
                  content: [
                    {
                      title:
                        "8.1.2.1 发布、传送、翻译、编辑、传播、储存违反国家法律法规禁止的内容：",
                      content: [
                        {
                          title: "（1）违反宪法确定的基本原则的；"
                        },
                        {
                          title:
                            "（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；"
                        },
                        {
                          title: "（3）损害国家荣誉和利益的；"
                        },
                        {
                          title: "（4）煽动民族仇恨、民族歧视，破坏民族团结的；"
                        },
                        {
                          title: "（5）破坏国家宗教政策，宣扬邪教和封建迷信的；"
                        },
                        {
                          title: "（6）散布谣言，扰乱社会秩序，破坏社会稳定的；"
                        },
                        {
                          title:
                            "（7）散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；"
                        },
                        {
                          title: "（8）侮辱或者诽谤他人，侵害他人合法权益的；"
                        },
                        {
                          title:
                            "（9）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；"
                        },
                        {
                          title: "（10）以非法民间组织名义活动的；"
                        },
                        {
                          title: "（11）含有法律、行政法规禁止的其他内容的。"
                        }
                      ]
                    },
                    {
                      title:
                        "8.1.2.2 发布、翻译、编辑、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容。"
                    },
                    {
                      title: "8.1.2.3 涉及他人隐私、个人信息或资料的。"
                    },
                    {
                      title:
                        "8.1.2.4 发表、传送、翻译、编辑、传播骚扰、广告信息、过度营销信息及垃圾信息或含有任何性或性暗示的。"
                    },
                    {
                      title:
                        "8.1.2.5 其他违反法律法规、政策及公序良俗、社会公德或干扰本服务正常运营和侵犯其他用户或第三方合法权益内容的信息。"
                    }
                  ]
                }
              ]
            },
            {
              title: "8.2 使用规范",
              content: [
                {
                  title:
                    "8.2.1 除非法律允许或汉典书面许可，您使用本服务过程中不得从事下列行为",
                  content: [
                    {
                      title:
                        "8.2.1.1 对本服务进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本服务的源代码。"
                    },
                    {
                      title:
                        "8.2.1.2 对汉典拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等。"
                    },
                    {
                      title:
                        "8.2.1.3 对本服务运行过程中释放到任何终端内存中的数据、本服务运行过程中客户端与服务器端的交互数据，以及本服务及运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经汉典授权的第三方工具/服务接入本服务和相关系统。"
                    },
                    {
                      title:
                        "8.2.1.4 通过修改或伪造本服务运行中的指令、数据，增加、删减、变动本服务的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的。"
                    },
                    {
                      title:
                        "8.2.1.5 通过非汉典开发、授权的第三方软件、插件、外挂、系统，登录或使用本服务，或制作、发布、传播上述工具；"
                    },
                    {
                      title:
                        "8.2.1.6 自行或者授权他人、第三方软件对本服务及其组件、模块、数据进行干扰。"
                    },
                    {
                      title:
                        "8.2.1.7 其他未经汉典明示授权或违反法律法规、政策的行为。"
                    }
                  ]
                },
                {
                  title:
                    "8.2.2 您理解并同意，基于用户体验、汉典或相关服务平台运营安全、平台规则要求及健康发展等综合因素，汉典有权选择提供服务的对象，有权决定功能设置，有权决定功能开放、数据接口和相关数据披露的对象和范围。针对以下情形，有权视具体情况中止或终止提供本服务，包括但不限于：",
                  content: [
                    {
                      title: "8.2.2.1 违反法律法规或本协议规定的"
                    },
                    {
                      title: "8.2.2.2 影响服务体验的。"
                    },
                    {
                      title: "8.2.2.3 存在安全隐患的。"
                    },
                    {
                      title:
                        "8.2.2.4 与汉典或其服务平台已有主要功能或功能组件相似、相同，或可实现上述功能或功能组件的主要效用的。"
                    },
                    {
                      title:
                        "8.2.2.5 界面、风格、功能、描述或使用者体验与汉典或其服务平台类似，可能造成汉典用户认为其所使用的功能或服务来源于汉典或经汉典授权的。"
                    },
                    {
                      title:
                        "8.2.2.6 违背汉典或其服务平台运营原则，或不符合汉典其他管理要求的。"
                    }
                  ]
                }
              ]
            },
            {
              title:
                "8.3 服务运营规范,除非法律允许或汉典书面许可，您使用本服务过程中不得从事下列行为：",
              content: [
                {
                  title: "8.3.1 提交、发布虚假信息，或冒充、利用他人名义的。"
                },
                {
                  title: "8.3.2 诱导其他用户点击链接页面或分享信息的。"
                },
                {
                  title: "8.3.3 虚构事实、隐瞒真相以误导、欺骗他人的。"
                },
                {
                  title:
                    "8.3.4 侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的。"
                },
                {
                  title:
                    "8.3.5 未经汉典书面许可利用本服务任何功能进行推广或互相推广的。"
                },
                {
                  title: "8.3.6 利用本服务从事任何违法犯罪活动的。"
                },
                {
                  title:
                    "8.3.7 制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的。"
                },
                {
                  title:
                    "8.3.8 其他违反法律法规规定、侵犯其他用户合法权益、干扰产品正常运营或汉典未明示授权的行为。"
                }
              ]
            },
            {
              title: "8.4 对自己行为负责",
              content: [
                {
                  title:
                    "8.4.1您充分了解并同意，您必须为自己的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。您应对本服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。汉典无法且不会对因前述风险而导致的任何损失或损害承担责任。您保证，您使用本服务所从事的任何活动均不会违反对您有约束力的任何法律文件，如您违反上述保证的，由您自行承担责任。"
                }
              ]
            },
            {
              title: "8.5 违约处理",
              content: [
                {
                  title:
                    "8.5.1 如果汉典发现或收到他人举报或投诉用户违反本协议约定的，汉典有权不经通知随时对相关内容进行删除、屏蔽，并视行为情节处以包括但不限于警告、限制或禁止使用部分或全部功能、甚至帐号注销的处罚，并公告处理结果。"
                },
                {
                  title:
                    "8.5.2 您理解并同意，汉典有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应独自承担由此而产生的一切法律责任。"
                },
                {
                  title:
                    "8.5.3 您理解并同意，因您违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，您应当独立承担责任；汉典因此遭受损失的，您也应当一并赔偿。"
                }
              ]
            }
          ]
        },
        {
          title: "9. 知识产权声明",
          content: [
            {
              title:
                "9.1 汉典是本服务、服务载体及相关内容的知识产权权利人。本服务的一切著作权、商标权、专利权、商业秘密等知识产权，以及与本服务相关的所有信息内容（包括但不限于文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国法律法规和相应的国际条约保护，汉典享有上述知识产权，但相关权利人依照法律规定应享有的权利除外。"
            },
            {
              title:
                "9.2 未经汉典或相关权利人书面同意，您不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。"
            }
          ]
        },
        {
          title: "10. 终端安全责任",
          content: [
            {
              title:
                "10.1 您理解并同意，本服务同大多数互联网产品一样，可能会受多种因素影响，包括但不限于用户原因、网络服务质量、社会环境等；也可能会受各种安全问题的侵扰，包括但不限于他人非法利用用户资料，进行现实中的骚扰；用户下载安装的其他软件或访问的其他网站中可能含有病毒、木马程序或其他恶意程序，威胁您的终端设备信息和数据安全，继而影响本服务的正常使用等。因此，您应加强信息安全及个人信息的保护意识，注意密码保护，以免遭受损失。"
            },
            {
              title:
                "10.2 您不得制作、发布、使用、传播用于窃取他人个人信息、财产的恶意程序。"
            },
            {
              title:
                "10.3 维护服务安全与正常使用是汉典和您的共同责任，汉典将按照行业标准合理审慎地采取必要技术措施保护您的终端设备信息和数据安全，但是您承认和同意汉典并不能就此提供完全保证。"
            }
          ]
        },
        {
          title: "11. 第三方软件或技术",
          content: [
            {
              title:
                "11.1 本服务可能会使用第三方软件或技术（包括本服务可能使用的开源代码和公共领域代码等，下同），这种使用已经获得合法授权。"
            },
            {
              title:
                "11.2 本服务如果使用了第三方的软件或技术，汉典将按照相关法规或约定，对相关的协议或其他文件，可能通过本协议附件、在本服务安装包特定文件夹中打包、或通过开源软件页面等形式进行展示，它们可能会以“软件使用许可协议”、“授权协议”、“开源代码许可证”或其他形式来表达。前述通过各种形式展现的相关协议、其他文件及网页，均是本协议不可分割的组成部分，与本协议具有同等的法律效力，您应当遵守这些要求。如果您没有遵守这些要求，该第三方或者国家机关可能会对您提起诉讼、罚款或采取其他制裁措施，并要求汉典给予协助，您应当自行承担法律责任。"
            },
            {
              title:
                "11.3 如因本服务使用的第三方软件或技术引发的任何纠纷，应由该第三方负责解决，汉典不承担任何责任。汉典不对第三方软件或技术提供客服支持，若您需要获取支持，请与第三方联系。"
            }
          ]
        },
        {
          title: "12. 其他",
          content: [
            {
              title:
                "12.1 您使用本服务即视为您已阅读并同意受本协议的约束。汉典有权在必要时修改本协议条款。您可以在本服务的最新版本中查阅相关协议条款。本协议条款变更后，如果您继续使用本服务，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用本服务。"
            },
            {
              title: "12.2 本协议签订地为中华人民共和国北京市朝阳区。"
            },
            {
              title:
                "12.3 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。"
            },
            {
              title:
                "12.4 若您和汉典间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。"
            },
            {
              title:
                "12.5 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。"
            },
            {
              title:
                "12.6 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。"
            }
          ]
        }
      ]
    };
  },
  mounted() {
    this.loading = false;
  }
};
</script>

<style lang="less" scoped>
.use-infomation {
  margin: 0;
  padding: 0 0.3rem 0.35rem;
  color: #4b4b4b;

  div {
    word-break: break-all;
    word-wrap: break-word;
  }

  .title {
    font-size: 1.2em;
    text-align: center;
    padding: 0.25rem 0;
    font-weight: 500;
    color: #333;
    border-bottom: 1px solid #ccc;
  }

  .content-1 {
    margin-top: 0.25rem;
  }

  .content-1,
  .content-2,
  .content-3 {
    margin-bottom: 0.1rem;
  }

  .content-4 .one-title {
    color: #555;
    font-weight: 500;
    padding: 15px 0 5px 0;
    margin-bottom: 10px;
    text-align: center;
    border-bottom: 1px solid rgb(81, 81, 175);
  }

  .content-4 .two-title {
    /* text-indent: 2em; */
    padding: 5px 0;
  }

  .content-4 .three-title {
    font-size: 0.95em;
    text-indent: 15px;
  }

  .content-4 .four-title {
    font-size: 0.9em;
    text-indent: 0.3rem;
    color: #666;
    /* background-color: #efefef; */
  }

  .content-4 .five-title {
    font-size: 0.8em;
    color: #777;
    line-height: 1.5em;
  }
}
</style>
