// pages/customer-service/index.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    service: {
      time: '服务时间',
      serviceTime: '周一到周五 | 09:00 - 17:00',
      servicePhone: '010-56903307 | 56903303',
      phone: '客服电话'
    }
    // steps: [{
    //     text: '步骤一',
    //     desc: '扫码或查找【汉典中医】小程序（患者端）→添加小程序',
    //   },
    //   {
    //     text: '步骤二',
    //     desc: '进入首页→了解小程序功能,【三大功能】找医生、拍方抓药、云药房.(Ps：云药房正在加进建设中，敬请期待。如需体验服务内容，请先注册账号。)',
    //   },
    //   {
    //     text: '步骤三',
    //     desc: '注册账号→登录体验服务内容,输入手机号码及发送的验证码，设置登录密码即可完成注册。再次使用时，直接输入手机号和登录密码进行登录。',
    //   },
    //   {
    //     text: '步骤四',
    //     desc: '完善个人信息→畅享方便快捷新体验,只有完善个人及患者信息，才可以进行复诊预约、拍方抓药等线上复诊业务的相关服务,带*为必填信息，请务必填选，同时保证填选信息真实。',
    //   },
    //   {
    //     text: '步骤五',
    //     desc: '首次使用→【找医生】根据实际需要，找到适合患者的中医名医专家。对应的医生信息窗口右下角，点【复诊预约】描述自己的病症（图文或语音）或上传过往门诊病历等，付款下单等待医生回复问诊。医生回复并完成线上问诊，开具处方。',
    //   },
    //   {
    //     text: '步骤六',
    //     desc: '再次使用→【拍方抓药】,根据实际需要，患者可以直接选择之前复诊的中医名医专家。上传过往门诊病历及处方，描述自己的病症（图文或语音）以及需要抓药的药品名称、数量，点【上传处方】，返回首页。等待医生回复处理。医生回复（如有必要，需要跟患者进行相关信息的确认），确认无误后再开具处方。',
    //   },
    // ],
    // active:5
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})